package com.pierrejanineh.cocacola.data.repository

import com.pierrejanineh.cocacola.data.model.SingleAd

class AdRepository {
    fun getAds(): List<SingleAd> {
        // TODO: Dummy implementation
        return listOf(
            SingleAd( "https://datilishes.b-cdn.net/wp-content/uploads/2023/09/מוזס-שופ-צילום-גיל-אבירם-5-2048x1365.jpg", "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. ושבעגט ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.", "סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק. מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי.\n"),
            SingleAd( "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSq2GjswAa3h3_44Uz-TiKXUERaPcKjq2FGxQ&s", "כותרת 2", "גוף"),
            SingleAd( "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTN8Cio9bKOUd-YUTjDdadi3QgxZ7ZgtfpvSg&s", "כותרת 3", "גוף")
        )
    }
}